{
    "ohloh": {
        "main_language": "Python", 
        "max_month": "2015-01-01T00:00:00Z", 
        "description": "In 2008, a number of free software developers and activists gathered at the FSF to attempt to answer the question “What should software freedom look like on the participatory web?” Their answer, the Franklin Street Statement has lead to the development of autonomo.us community, and free software projects including Identi.ca and Libre.fm.\n\nIdenti.ca and Libre.fm address the need for micro-blogging and music sharing services and software that respect users’ freedom and autonomy.\n\nGNU MediaGoblin emerges from this milieu to create a platform for us to share photos, video and other media in an environment that respects our freedom and independence. In the future MediaGoblin will provide tools to facilitate collaboration on media projects.", 
        "tags": [
            "art", 
            "python", 
            "decentralization", 
            "asciiart", 
            "transcoding", 
            "photos", 
            "gnu", 
            "images", 
            "media", 
            "federated", 
            "autonomous", 
            "video", 
            "audio", 
            "photography", 
            "social"
        ], 
        "total_code_lines": 54237, 
        "total_contributor_count": 94, 
        "twelve_month_contributor_count": 21, 
        "updated_at": "2015-01-10T20:56:02Z", 
        "analysis": "19851091", 
        "min_month": "2010-07-01T00:00:00Z", 
        "factoids": [
            "Large, active development team", 
            "Well-established codebase", 
            "Well-commented source code", 
            "Decreasing Y-O-Y development activity"
        ], 
        "twelve_month_commit_count": 651, 
        "total_commit_count": 5047, 
        "id": "512069", 
        "name": "GNU MediaGoblin"
    }, 
    "description": "[GNU MediaGoblin](http://mediagoblin.org) (also shortened to MediaGoblin or GMG) is a free, decentralized Web platform (server software) for hosting and sharing digital media, aimed at providing an extensible, adaptive, and freedom-respectful software alternative to major media publishing services such as Flickr, deviantArt, YouTube, etc.-- [Wikipedia](http://en.wikipedia.org/wiki/MediaGoblin)", 
    "name": "MediaGoblin"
}