{
    "ohloh": {
        "main_language": "C", 
        "max_month": "2011-09-01T00:00:00Z", 
        "description": "The Phantom protocol is a system for decentralized anonymization of generic network traffic. It has been designed with the following main goals in mind: \n\n1. Completely decentralized. \n\n- No critical or weak points to attack or put (il)legal pressure on. \n\n\n2. Maximum resistance against all kinds of DoS attacks. \n\n- Direct technical destructive attacks will practically be the only possible way to even attempt to stop it. \n\n\n3. Theoretically secure anonymization. \n\n- Probabilistic methods (contrary to deterministic methods) must be used in a completely decentralized design like this, where no other peer can be trusted, so focus is put on optimizing these methods. \n\n\n4. Theoretically secure end-to-end transport encryption. \n\n- This is simple in itself, but still important in the context of anonymization. \n\n\n5. Completely (virtually) isolated from the \"normal\" Internet. \n\n- No one should have to worry about crimes being perpetrated from their own IP address. \n\n\n6. Maximum protection against identification of protocol usage through traffic analysis. \n\n- You never know what the next draconian law might be. \n\n\n7. Capable of handling larger data volumes, with acceptable throughput. \n\n- Most existing anonymization solutions are practically unusable for (or even prohibit) larger data volumes. \n\n\n8. Generic and well-abstracted design, compatible with all new and existing network enabled software. \n\n- Software application developer participation should not be needed, it should be easy to apply the anonymization to both new and already existing products like e.g. web browsers and file transfer software.", 
        "total_contributor_count": 2, 
        "total_code_lines": 11168, 
        "tags": [
            "anonymity"
        ], 
        "twelve_month_contributor_count": 0, 
        "updated_at": "2015-02-01T13:40:45Z", 
        "analysis": "19450716", 
        "min_month": "2008-05-01T00:00:00Z", 
        "factoids": [
            "Well-established codebase", 
            "Very few source code comments", 
            "Stable Y-O-Y development activity", 
            "No recent development activity"
        ], 
        "twelve_month_commit_count": 0, 
        "total_commit_count": 17, 
        "id": "22322", 
        "name": "phantom"
    }, 
    "description": "[Phantom](https://code.google.com/p/phantom/) is (was?) a system for generic, decentralized, unstoppable internet anonymity", 
    "name": "Phantom"
}