{
    "ohloh": {
        "main_language": "Java", 
        "max_month": "2014-02-01T00:00:00Z", 
        "description": "Sneer is a free and open source sovereign computing platform. It runs on your Windows, Mac or Linux machine (like Skype or Firefox) using the Java VM. It enables you to:\n\n    Create your personal cluster by sharing hardware resources (CPU, disk space, network bandwidth) with your friends.\n    Host your own social network, information and media.\n    Create sovereign applications and share them with others.\n    Download and run sovereign applications created by others.\n\nYou can do all these things directly with your peers, in an autonomous, sovereign way, without depending on online service providers such as email providers, Google, Facebook, etc.", 
        "tags": [
            "mp3", 
            "multiplatform", 
            "file_sharing", 
            "private", 
            "peer-2-peer", 
            "java", 
            "peer-to-peer", 
            "network", 
            "secure", 
            "p2p", 
            "filesharing", 
            "chat", 
            "backup"
        ], 
        "total_code_lines": 69649, 
        "total_contributor_count": 51, 
        "twelve_month_contributor_count": 0, 
        "updated_at": "2015-03-27T08:06:30Z", 
        "analysis": "19513205", 
        "min_month": "2005-04-01T00:00:00Z", 
        "factoids": [
            "Mature, well-established codebase", 
            "Decreasing Y-O-Y development activity", 
            "Very few source code comments", 
            "No recent development activity"
        ], 
        "twelve_month_commit_count": 0, 
        "total_commit_count": 8347, 
        "id": "139248", 
        "name": "Sneer - The Sovereign Computing Platform"
    }, 
    "description": "[Sneer](http://sneer.me) is a free and open source sovereign computing platform. It runs on your Windows, Mac or Linux machine (like Skype or Firefox) using the Java VM. It enables you to create your personal cluster by sharing hardware resources (CPU, disk space, network bandwidth) with your friends, host your own social network, information and media, create sovereign applications and share them with others, download and run sovereign applications created by others.You can do all these things directly with your peers, in an autonomous, sovereign way, without depending on online service providers such as email providers, Google, Facebook, etc.", 
    "name": "Sneer"
}