{
    "ohloh": {
        "main_language": "C", 
        "max_month": "2015-02-01T00:00:00Z", 
        "description": "Tor is a toolset for a wide range of organizations and people that want to improve their safety and security on the Internet. Using Tor can help you anonymize web browsing and publishing, instant messaging, IRC, SSH, and other applications that use the TCP protocol. Tor also provides a platform on which software developers can build new applications with built-in anonymity, safety, and privacy features.\n\nTor aims to defend against traffic analysis, a form of network surveillance that threatens personal anonymity and privacy, confidential business activities and relationships, and state security. Communications are bounced around a distributed network of servers called onion routers, protecting you from websites that build profiles of your interests, local eavesdroppers that read your data", 
        "tags": [
            "anonymous", 
            "distributed", 
            "crypto", 
            "tls", 
            "cryptography", 
            "anonymity", 
            "onion", 
            "security", 
            "encryption", 
            "anonymizer", 
            "networking", 
            "p2p", 
            "tor", 
            "privacy", 
            "censorship"
        ], 
        "total_code_lines": 426509, 
        "total_contributor_count": 281, 
        "twelve_month_contributor_count": 97, 
        "updated_at": "2015-02-18T10:04:50Z", 
        "analysis": "19851945", 
        "min_month": "2002-06-01T00:00:00Z", 
        "factoids": [
            "Mature, well-established codebase", 
            "Very large, active development team", 
            "Average number of code comments", 
            "Stable Y-O-Y development activity"
        ], 
        "twelve_month_commit_count": 4906, 
        "total_commit_count": 44465, 
        "id": "5675", 
        "name": "Tor"
    }, 
    "description": "[Tor](https://www.torproject.org/) protects you by bouncing your communications around a distributed network of relays run by volunteers all around the world: it prevents somebody watching your Internet connection from learning what sites you visit, and it prevents the sites you visit from learning your physical location.", 
    "name": "Tor"
}